<abi-corpus version='2.4' path='./mxbuild/linux-amd64/GRAALPY_JVM_STANDALONE/lib/graalpy25.0/libpython-native.so' architecture='elf-amd-x86_64' soname='libpython-native.so'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='GraalPyArray_Data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyArray_Resize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyCFunction_GetDoc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyCFunction_GetMethodDef' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyCFunction_GetModule' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyCFunction_SetDoc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyCFunction_SetMethodDef' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='GraalPyCFunction_SetModule' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='printf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setlocale' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='snprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sysconf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='tolower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vsnprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vsprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcslen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <function-decl name='PyErr_WarnFormat' mangled-name='PyErr_WarnFormat' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1094' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnFormat' hash='aef8ae271119d313'>
      <parameter type-id='type-id-3' name='source' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1122' column='1'/>
      <parameter type-id='type-id-4' name='stack_level' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1122' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1123' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyErr_ResourceWarning' mangled-name='PyErr_ResourceWarning' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_ResourceWarning' hash='aef8ae271119d313'>
      <parameter type-id='type-id-3' name='source' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1122' column='1'/>
      <parameter type-id='type-id-4' name='stack_level' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1122' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1123' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyErr_WarnEx' mangled-name='PyErr_WarnEx' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnEx' hash='b9a9afefd0127411'>
      <parameter type-id='type-id-3' name='category' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1137' column='1'/>
      <parameter type-id='type-id-5' name='text' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1137' column='1'/>
      <parameter type-id='type-id-4' name='stack_level' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1137' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyErr_WarnExplicitObject' mangled-name='PyErr_WarnExplicitObject' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnExplicitObject' hash='d382a01167a0ac75'>
      <parameter type-id='type-id-3' name='category' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1163' column='1'/>
      <parameter type-id='type-id-3' name='message' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1163' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1164' column='1'/>
      <parameter type-id='type-id-6' name='lineno' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1164' column='1'/>
      <parameter type-id='type-id-3' name='module' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1165' column='1'/>
      <parameter type-id='type-id-3' name='registry' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1165' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyErr_WarnExplicit' mangled-name='PyErr_WarnExplicit' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnExplicit' hash='fed7f557eadcb2a1'>
      <parameter type-id='type-id-3' name='category' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1183' column='1'/>
      <parameter type-id='type-id-5' name='text' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1183' column='1'/>
      <parameter type-id='type-id-5' name='filename_str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1184' column='1'/>
      <parameter type-id='type-id-6' name='lineno' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1184' column='1'/>
      <parameter type-id='type-id-5' name='module_str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1185' column='1'/>
      <parameter type-id='type-id-3' name='registry' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1185' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyErr_WarnExplicitFormat' mangled-name='PyErr_WarnExplicitFormat' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnExplicitFormat' hash='6944794d2b58f3bc'>
      <parameter type-id='type-id-3' name='category' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1215' column='1'/>
      <parameter type-id='type-id-5' name='filename_str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1216' column='1'/>
      <parameter type-id='type-id-6' name='lineno' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1216' column='1'/>
      <parameter type-id='type-id-5' name='module_str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1217' column='1'/>
      <parameter type-id='type-id-3' name='registry' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1217' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/_warnings.c' line='1218' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='backtrace' filepath='/usr/include/execinfo.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='backtrace' hash='03f7c1904d44eca6'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='backtrace_symbols_fd' filepath='/usr/include/execinfo.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='backtrace_symbols_fd' hash='ae5f1af54d2b4e86'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='stderr' type-id='type-id-10' visibility='default' filepath='/usr/include/stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='vsprintf' filepath='/usr/include/stdio.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vsprintf' hash='3087f27ed03708ac'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='9e970561a213ee08'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='sleep' filepath='/usr/include/unistd.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sleep' hash='0389e499374a3f97'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='execv' filepath='/usr/include/unistd.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execv' hash='dca24aa2bd4be2b5'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpid' hash='388da3fa973fde78'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fork' filepath='/usr/include/unistd.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fork' hash='388da3fa973fde78'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' hash='12e961bf1e4a9695' id='type-id-17'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='f9ce30c5a431fb75' id='type-id-18'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='65b6095a7d5e0231' id='type-id-19'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='e3b06c3996daed44' id='type-id-20'>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' hash='616dbb5e7e171881' id='type-id-22'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='037d575bc520db4e' id='type-id-23'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='e9ea91a7eab8302c' id='type-id-24'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='e2a7c3907994fdb5' id='type-id-26'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-27'/>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckBuffer' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer' hash='580f243fc519f291'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='354' column='1'/>
      <parameter type-id='type-id-28' name='buffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='355' column='1'/>
      <parameter type-id='type-id-29' name='buffer_len' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='356' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer' hash='4e8b341d97851d68'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='368' column='1'/>
      <parameter type-id='type-id-7' name='buffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='369' column='1'/>
      <parameter type-id='type-id-29' name='buffer_len' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='370' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer' hash='4e8b341d97851d68'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='368' column='1'/>
      <parameter type-id='type-id-7' name='buffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='369' column='1'/>
      <parameter type-id='type-id-29' name='buffer_len' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='370' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer' hash='c7b354fc0c814775'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1'/>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous' hash='f5271a693a76bf05'>
      <parameter type-id='type-id-31' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='480' column='1'/>
      <parameter type-id='type-id-32' name='order' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='480' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer' hash='3be4f7761e43ee7c'>
      <parameter type-id='type-id-31' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='496' column='1'/>
      <parameter type-id='type-id-26' name='indices' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='496' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F' hash='dd274ad6227d4b2a'>
      <parameter type-id='type-id-6' name='nd' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1'/>
      <parameter type-id='type-id-29' name='index' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1'/>
      <parameter type-id='type-id-26' name='shape' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C' hash='dd274ad6227d4b2a'>
      <parameter type-id='type-id-6' name='nd' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1'/>
      <parameter type-id='type-id-29' name='index' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1'/>
      <parameter type-id='type-id-26' name='shape' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='528' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_SizeFromFormat' mangled-name='PyBuffer_SizeFromFormat' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='544' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_SizeFromFormat' hash='37acfa132d6f01f2'>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='544' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous' hash='96a7f9759f1d44f2'>
      <parameter type-id='type-id-31' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='579' column='1'/>
      <parameter type-id='type-id-1' name='buf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='579' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='579' column='1'/>
      <parameter type-id='type-id-32' name='fort' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='579' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides' hash='aef32007a30c6530'>
      <parameter type-id='type-id-6' name='nd' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='702' column='1'/>
      <parameter type-id='type-id-29' name='shape' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='702' column='1'/>
      <parameter type-id='type-id-29' name='strides' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='703' column='1'/>
      <parameter type-id='type-id-6' name='itemsize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='703' column='1'/>
      <parameter type-id='type-id-32' name='fort' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='704' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo' hash='2da70e1c36f66744'>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='726' column='1'/>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='726' column='1'/>
      <parameter type-id='type-id-1' name='buf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='726' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='726' column='1'/>
      <parameter type-id='type-id-6' name='readonly' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='727' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='727' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release' hash='1a8614bcd1dd8acc'>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='763' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='840' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1076' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyNumber_PowerNoMod' mangled-name='_PyNumber_PowerNoMod' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNumber_PowerNoMod' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyNumber_InPlacePowerNoMod' mangled-name='_PyNumber_InPlacePowerNoMod' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNumber_InPlacePowerNoMod' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t' hash='fb1738967c3f94b2'>
      <parameter type-id='type-id-3' name='item' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1523' column='1'/>
      <parameter type-id='type-id-3' name='err' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1523' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1845' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat' hash='9b79932cbc51c9a6'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1941' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem' hash='9b79932cbc51c9a6'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2000' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem' hash='b4ea4a9949b53d1b'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem' hash='e42a80ecf1ee5bbb'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast' hash='0de31c15d18813e8'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString' hash='0de31c15d18813e8'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString' hash='dc433dc161735f10'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1'/>
      <parameter type-id='type-id-3' name='value' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString' hash='3b98d83926d2d2d8'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2448' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2448' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyIter_Send' mangled-name='PyIter_Send' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Send' hash='e7ea1b7cedd01ee9'>
      <parameter type-id='type-id-3' name='iter' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1'/>
      <parameter type-id='type-id-3' name='arg' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1'/>
      <parameter type-id='type-id-33' name='result' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='8759147de6871040' id='type-id-35'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='2e839175b6f0d64e' id='type-id-36'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='a8fa4819a02c2400' id='type-id-37'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='9b79932cbc51c9a6' id='type-id-38'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='0de31c15d18813e8' id='type-id-39'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f1ac870e4b09703' id='type-id-40'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='037d575bc520db4e' id='type-id-41'>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='e7ea1b7cedd01ee9' id='type-id-42'>
      <parameter type-id='type-id-3' name='iter' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1'/>
      <parameter type-id='type-id-3' name='arg' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1'/>
      <parameter type-id='type-id-33' name='result' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2947' column='1'/>
      <return type-id='type-id-34'/>
    </function-type>
    <function-type size-in-bits='64' hash='c531016fc0a54425' id='type-id-43'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' hash='fb1738967c3f94b2' id='type-id-45'>
      <parameter type-id='type-id-3' name='item' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1523' column='1'/>
      <parameter type-id='type-id-3' name='err' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='1523' column='1'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='21e5a2f6e2b75eff' id='type-id-46'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2378' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='c4e1b837fccfe2d0' id='type-id-47'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='63c03439f3e9ae1a' id='type-id-48'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='c7b354fc0c814775' id='type-id-49'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1'/>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='397' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='e42a80ecf1ee5bbb' id='type-id-50'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='b4ea4a9949b53d1b' id='type-id-51'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='3b98d83926d2d2d8' id='type-id-52'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2448' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2448' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='dc433dc161735f10' id='type-id-53'>
      <parameter type-id='type-id-3' name='o' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1'/>
      <parameter type-id='type-id-3' name='value' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/abstract.c' line='2429' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='65b6095a7d5e0231' id='type-id-54'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='e3b06c3996daed44' id='type-id-55'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-56'>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-57'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/boolobject.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-58'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/boolobject.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong' hash='7f1ac870e4b09703#2'>
      <parameter type-id='type-id-59' name='ok' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/boolobject.c' line='27' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f1ac870e4b09703#2' id='type-id-60'>
      <parameter type-id='type-id-59' name='ok' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/boolobject.c' line='27' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-61'/>
    <function-decl name='bytearray_getbuffer' mangled-name='bytearray_getbuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bytearray_getbuffer' hash='6aff5ca1cb1a6c24'>
      <parameter type-id='type-id-62' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='55' column='1'/>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='55' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='55' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='bytearray_releasebuffer' mangled-name='bytearray_releasebuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bytearray_releasebuffer' hash='2f20c51c05855970'>
      <parameter type-id='type-id-62' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='72' column='1'/>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='72' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize' hash='66fc7990a8a05c35'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytearrayobject.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='66fc7990a8a05c35' id='type-id-63'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='99cbf60fdda69f75' id='type-id-64'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='d62cc99a9af79d55' id='type-id-65'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='766829b0d5b5b833' id='type-id-66'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='4096' hash='5d44f4aa5ab53217' id='type-id-67'>
      <subrange length='512' lower-bound='0' upper-bound='511' type-id='type-id-13' size-in-bits='64' is-anonymous='yes' hash='c0710bf9002b732f' id='type-id-68'/>
    </array-type-def>
    <class-decl name='_PyBytesWriter' is-struct='yes' naming-typedef-id='type-id-69' visibility='default' size-in-bits='4416' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='61' column='1' hash='59f8f90153d98f0a' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='min_size' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_bytearray' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='overallocate' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='use_small_buffer' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='small_buffer' type-id='type-id-67' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyBytesWriter' type-id='type-id-70' size-in-bits='4416' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='82' column='1' id='type-id-69'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='00267502e6434a6b' id='type-id-71'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-72'/>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromStringAndSize' hash='66fc7990a8a05c35'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyBytes_FromString' mangled-name='PyBytes_FromString' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromString' hash='65b6095a7d5e0231'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormatV' mangled-name='PyBytes_FromFormatV' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormatV' hash='6c79ff3e652dd0b1'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormat' mangled-name='PyBytes_FromFormat' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormat' hash='65b6095a7d5e0231'>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='302' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize' hash='ea3cd7f6d0df615e'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1158' column='1'/>
      <parameter type-id='type-id-73' name='s' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1159' column='1'/>
      <parameter type-id='type-id-29' name='len' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1160' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='bytes_buffer_getbuffer' mangled-name='bytes_buffer_getbuffer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bytes_buffer_getbuffer' hash='082671f86242033b'>
      <parameter type-id='type-id-74' name='self' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1591' column='1'/>
      <parameter type-id='type-id-30' name='view' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1591' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='1591' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='GraalPyPrivate_Bytes_SubtypeNew' mangled-name='GraalPyPrivate_Bytes_SubtypeNew' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='GraalPyPrivate_Bytes_SubtypeNew' hash='fd624767629cf53a'>
      <parameter type-id='type-id-44' name='type' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2825' column='1'/>
      <parameter type-id='type-id-75' name='contents' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2825' column='1'/>
      <parameter type-id='type-id-4' name='n' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2825' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyBytes_Concat' mangled-name='PyBytes_Concat' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2898' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Concat' hash='27ba06648cffad25'>
      <parameter type-id='type-id-33' name='pv' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2905' column='1'/>
      <parameter type-id='type-id-3' name='w' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2905' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel' hash='27ba06648cffad25'>
      <parameter type-id='type-id-33' name='pv' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2905' column='1'/>
      <parameter type-id='type-id-3' name='w' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2905' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize' hash='23833f40dd2faae6'>
      <parameter type-id='type-id-33' name='pv' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2927' column='1'/>
      <parameter type-id='type-id-4' name='newsize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='2927' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init' hash='cef42127132d8a3c'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3112' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc' hash='cef42127132d8a3c'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3112' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize' hash='e0938495b7d885fb'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1'/>
      <parameter type-id='type-id-1' name='str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare' hash='e0938495b7d885fb'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1'/>
      <parameter type-id='type-id-1' name='str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3252' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc' hash='e0938495b7d885fb'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3282' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3282' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish' hash='874a13c633ec3603'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3312' column='1'/>
      <parameter type-id='type-id-1' name='str' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3312' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes' hash='e0938495b7d885fb'>
      <parameter type-id='type-id-71' name='writer' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3356' column='1'/>
      <parameter type-id='type-id-1' name='ptr' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3356' column='1'/>
      <parameter type-id='type-id-1' name='bytes' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3357' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/bytesobject.c' line='3357' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f819e60dcc3b892' id='type-id-77'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f72d8f75a483747' id='type-id-78'>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f72d8f75a483747' id='type-id-79'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-80'/>
    <function-decl name='_Py_CheckFunctionResult' mangled-name='_Py_CheckFunctionResult' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckFunctionResult' hash='e54887a4f55c7227'>
      <parameter type-id='type-id-21' name='tstate' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='31' column='1'/>
      <parameter type-id='type-id-3' name='callable' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='31' column='1'/>
      <parameter type-id='type-id-3' name='result' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='32' column='1'/>
      <parameter type-id='type-id-5' name='where' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='32' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_Py_CheckSlotResult' mangled-name='_Py_CheckSlotResult' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckSlotResult' hash='1eb44353a47c086c'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='81' column='1'/>
      <parameter type-id='type-id-5' name='slot_name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='81' column='1'/>
      <parameter type-id='type-id-6' name='success' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='81' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_CallNoArgs' mangled-name='PyObject_CallNoArgs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallNoArgs' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyObject_FastCallDictTstate' mangled-name='_PyObject_FastCallDictTstate' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCallDictTstate' hash='23391610bc794232'>
      <parameter type-id='type-id-21' name='tstate' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='146' column='1'/>
      <parameter type-id='type-id-3' name='callable' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='146' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='147' column='1'/>
      <parameter type-id='type-id-76' name='nargsf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='147' column='1'/>
      <parameter type-id='type-id-3' name='kwargs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='148' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_VectorcallDict' mangled-name='PyObject_VectorcallDict' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_VectorcallDict' hash='fe9af27801a63d1d'>
      <parameter type-id='type-id-3' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-76' name='nargsf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <parameter type-id='type-id-3' name='kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyVectorcall_Function' mangled-name='PyVectorcall_Function' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyVectorcall_Function' hash='9ca1945080fc7f42'>
      <parameter type-id='type-id-3' name='callable' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='294' column='1'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='PyVectorcall_Call' mangled-name='PyVectorcall_Call' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyVectorcall_Call' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_Vectorcall' mangled-name='PyObject_Vectorcall' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Vectorcall' hash='fe9af27801a63d1d'>
      <parameter type-id='type-id-3' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-76' name='nargsf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <parameter type-id='type-id-3' name='kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyObject_FastCall' mangled-name='_PyObject_FastCall' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCall' hash='e6e94355f047f535'>
      <parameter type-id='type-id-3' name='func' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1'/>
      <parameter type-id='type-id-4' name='nargs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_Call' mangled-name='PyObject_Call' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Call' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_CallOneArg' mangled-name='PyObject_CallOneArg' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallOneArg' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyEval_CallObjectWithKeywords' mangled-name='PyEval_CallObjectWithKeywords' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallObjectWithKeywords' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_CallObject' mangled-name='PyObject_CallObject' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallObject' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_CallFunction' mangled-name='PyObject_CallFunction' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunction' hash='0de31c15d18813e8'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyObject_CallFunction_SizeT' mangled-name='_PyObject_CallFunction_SizeT' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallFunction_SizeT' hash='0de31c15d18813e8'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_CallMethod' mangled-name='PyObject_CallMethod' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='694' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethod' hash='96e83fadc2e698c9'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='797' column='1'/>
      <parameter type-id='type-id-5' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='797' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='798' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT' hash='96e83fadc2e698c9'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='797' column='1'/>
      <parameter type-id='type-id-5' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='797' column='1'/>
      <parameter type-id='type-id-5' name='format' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='798' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_VectorcallMethod' mangled-name='PyObject_VectorcallMethod' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_VectorcallMethod' hash='fe9af27801a63d1d'>
      <parameter type-id='type-id-3' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-76' name='nargsf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <parameter type-id='type-id-3' name='kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='941' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='941' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='941' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodIdObjArgs' mangled-name='_PyObject_CallMethodIdObjArgs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='954' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodIdObjArgs' hash='92bcd1eedb212ecf'>
      <parameter type-id='type-id-3' name='obj' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='954' column='1'/>
      <parameter type-id='type-id-83' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='954' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs' hash='8759147de6871040'>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_PyStack_UnpackDict' mangled-name='_PyStack_UnpackDict' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_UnpackDict' hash='29339488a40a4774'>
      <parameter type-id='type-id-21' name='tstate' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1008' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1009' column='1'/>
      <parameter type-id='type-id-4' name='nargs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1009' column='1'/>
      <parameter type-id='type-id-3' name='kwargs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1010' column='1'/>
      <parameter type-id='type-id-33' name='p_kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1010' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='_PyStack_UnpackDict_Free' mangled-name='_PyStack_UnpackDict_Free' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_UnpackDict_Free' hash='06ed14ae09231ffd'>
      <parameter type-id='type-id-81' name='stack' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1077' column='1'/>
      <parameter type-id='type-id-4' name='nargs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1077' column='1'/>
      <parameter type-id='type-id-3' name='kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1078' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyStack_UnpackDict_FreeNoDecRef' mangled-name='_PyStack_UnpackDict_FreeNoDecRef' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_UnpackDict_FreeNoDecRef' hash='9792504e8d2bc7f0'>
      <parameter type-id='type-id-81' name='stack' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1088' column='1'/>
      <parameter type-id='type-id-3' name='kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1088' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyVectorcall_NARGS' mangled-name='PyVectorcall_NARGS' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyVectorcall_NARGS' hash='c013aa17bfe204e4'>
      <parameter type-id='type-id-76' name='n' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='1097' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='e6e94355f047f535' id='type-id-84'>
      <parameter type-id='type-id-3' name='func' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1'/>
      <parameter type-id='type-id-4' name='nargs' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='370' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='fe9af27801a63d1d' id='type-id-85'>
      <parameter type-id='type-id-3' name='name' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-81' name='args' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='905' column='1'/>
      <parameter type-id='type-id-76' name='nargsf' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <parameter type-id='type-id-3' name='kwnames' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/call.c' line='906' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='042db654b714b7ba' id='type-id-86'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='c7c140af45233693' id='type-id-87'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='2becf25ff6fa9501' id='type-id-89'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='6cb6125018dea49d' id='type-id-90'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='38f542d4fa676d84' id='type-id-91'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='4151269693869361' id='type-id-92'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' comp-dir-path='./graalpython/mxbuild/linux-amd64-jdk25/com.oracle.graal.python.cext/amd64' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='64' hash='0e031d7762803053' id='type-id-93'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-13' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-94'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-95' size-in-bits='192' hash='7d1d3b86b53c983c' id='type-id-96'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-13' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-94'/>
    </array-type-def>
    <enum-decl name='PyCodeEvent' naming-typedef-id='type-id-97' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='284' column='1' hash='2a657f7f68ef7fbb' id='type-id-98'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='PY_CODE_EVENT_CREATE' value='0'/>
      <enumerator name='PY_CODE_EVENT_DESTROY' value='1'/>
    </enum-decl>
    <enum-decl name='PyDict_WatchEvent' naming-typedef-id='type-id-100' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='106' column='1' hash='4f871e2f8788a208' id='type-id-101'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='PyDict_EVENT_ADDED' value='0'/>
      <enumerator name='PyDict_EVENT_MODIFIED' value='1'/>
      <enumerator name='PyDict_EVENT_DELETED' value='2'/>
      <enumerator name='PyDict_EVENT_CLONED' value='3'/>
      <enumerator name='PyDict_EVENT_CLEARED' value='4'/>
      <enumerator name='PyDict_EVENT_DEALLOCATED' value='5'/>
    </enum-decl>
    <enum-decl name='PyFunction_WatchEvent' naming-typedef-id='type-id-102' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='149' column='1' hash='7d40ab26c654828a' id='type-id-103'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='PyFunction_EVENT_CREATE' value='0'/>
      <enumerator name='PyFunction_EVENT_DESTROY' value='1'/>
      <enumerator name='PyFunction_EVENT_MODIFY_CODE' value='2'/>
      <enumerator name='PyFunction_EVENT_MODIFY_DEFAULTS' value='3'/>
      <enumerator name='PyFunction_EVENT_MODIFY_KWDEFAULTS' value='4'/>
    </enum-decl>
    <enum-decl name='PyLockStatus' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/pythread.h' line='17' column='1' hash='77203397064cb822' id='type-id-104'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='PY_LOCK_FAILURE' value='0'/>
      <enumerator name='PY_LOCK_ACQUIRED' value='1'/>
      <enumerator name='PY_LOCK_INTR' value='2'/>
    </enum-decl>
    <enum-decl name='PyMemAllocatorDomain' naming-typedef-id='type-id-105' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pymem.h' line='28' column='1' hash='f8accd1edafbed53' id='type-id-106'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='PYMEM_DOMAIN_RAW' value='0'/>
      <enumerator name='PYMEM_DOMAIN_MEM' value='1'/>
      <enumerator name='PYMEM_DOMAIN_OBJ' value='2'/>
    </enum-decl>
    <enum-decl name='_PyTime_round_t' naming-typedef-id='type-id-107' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='75' column='1' hash='ca3f652de070b9c2' id='type-id-108'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='_PyTime_ROUND_FLOOR' value='0'/>
      <enumerator name='_PyTime_ROUND_CEILING' value='1'/>
      <enumerator name='_PyTime_ROUND_HALF_EVEN' value='2'/>
      <enumerator name='_PyTime_ROUND_UP' value='3'/>
      <enumerator name='_PyTime_ROUND_TIMEOUT' value='3'/>
    </enum-decl>
    <enum-decl name='_Py_error_handler' naming-typedef-id='type-id-109' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_fileutils.h' line='23' column='1' hash='7861f53717db66e7' id='type-id-110'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='_Py_ERROR_UNKNOWN' value='0'/>
      <enumerator name='_Py_ERROR_STRICT' value='1'/>
      <enumerator name='_Py_ERROR_SURROGATEESCAPE' value='2'/>
      <enumerator name='_Py_ERROR_REPLACE' value='3'/>
      <enumerator name='_Py_ERROR_IGNORE' value='4'/>
      <enumerator name='_Py_ERROR_BACKSLASHREPLACE' value='5'/>
      <enumerator name='_Py_ERROR_SURROGATEPASS' value='6'/>
      <enumerator name='_Py_ERROR_XMLCHARREFREPLACE' value='7'/>
      <enumerator name='_Py_ERROR_OTHER' value='8'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='16' column='1' hash='e055a5c2e26e5062' id='type-id-111'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='_PyStatus_TYPE_OK' value='0'/>
      <enumerator name='_PyStatus_TYPE_ERROR' value='1'/>
      <enumerator name='_PyStatus_TYPE_EXIT' value='2'/>
    </enum-decl>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-112'/>
    <array-type-def dimensions='1' type-id='type-id-113' size-in-bits='1024' hash='773b854f26da872b' id='type-id-114'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-13' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-115'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-116'/>
    <class-decl name='PyASCIIObject' is-struct='yes' naming-typedef-id='type-id-117' visibility='default' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='57' column='1' hash='ea37ae135e36290c' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-120' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='state' type-id='type-id-121' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyByteArrayObject' is-struct='yes' naming-typedef-id='type-id-122' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='11' column='1' hash='d967453f635750b0' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-124' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_alloc' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ob_bytes' type-id='type-id-11' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ob_start' type-id='type-id-11' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ob_exports' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyBytesObject' is-struct='yes' naming-typedef-id='type-id-125' visibility='default' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='10' column='1' hash='01ae393096ad9e52' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-124' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_shash' type-id='type-id-120' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ob_sval' type-id='type-id-127' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyCFunctionObject' is-struct='yes' naming-typedef-id='type-id-128' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='12' column='1' hash='fe0dcd7fe6ce9042' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_ml' type-id='type-id-130' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_self' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_module' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_weakreflist' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vectorcall' type-id='type-id-82' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyCMethodObject' is-struct='yes' naming-typedef-id='type-id-131' visibility='default' size-in-bits='512' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='28' column='1' hash='815c47372f17390a' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-128' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mm_class' type-id='type-id-44' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyCompactUnicodeObject' is-struct='yes' naming-typedef-id='type-id-133' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='159' column='1' hash='9f053fbdd53a7dca' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-117' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='utf8_length' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='utf8' type-id='type-id-11' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyCompilerFlags' is-struct='yes' naming-typedef-id='type-id-135' visibility='default' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/compile.h' line='31' column='1' hash='090879dd9e58f055' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cf_flags' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/compile.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cf_feature_version' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/compile.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyDescrObject' is-struct='yes' naming-typedef-id='type-id-137' visibility='default' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='31' column='1' hash='72a1f7638821c7f6' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_type' type-id='type-id-44' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_name' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_qualname' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyDictObject' is-struct='yes' naming-typedef-id='type-id-139' visibility='default' size-in-bits='384' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='16' column='1' hash='2e175f8f97de8b89' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ma_used' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ma_version_tag' type-id='type-id-141' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ma_keys' type-id='type-id-142' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ma_values' type-id='type-id-143' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyFunctionObject' is-struct='yes' naming-typedef-id='type-id-144' visibility='default' size-in-bits='1152' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='41' column='1' hash='9b94d8f258d53da2' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func_globals' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='func_builtins' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='func_name' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='func_qualname' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='func_code' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='func_defaults' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='func_kwdefaults' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='func_closure' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='func_doc' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='func_dict' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='func_weakreflist' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='func_module' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='func_annotations' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='func_typeparams' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='vectorcall' type-id='type-id-82' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='func_version' type-id='type-id-146' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyGenObject' is-struct='yes' naming-typedef-id='type-id-147' visibility='default' size-in-bits='640' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='36' column='1' hash='bebc63695a4830d0' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gi_weakreflist' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gi_name' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gi_qualname' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gi_exc_state' type-id='type-id-149' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='gi_origin_or_finalizer' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='gi_hooks_inited' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='gi_closed' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='gi_running_async' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536'>
        <var-decl name='gi_frame_state' type-id='type-id-150' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gi_iframe' type-id='type-id-151' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyInstanceMethodObject' is-struct='yes' naming-typedef-id='type-id-152' visibility='default' size-in-bits='192' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='57' column='1' hash='906f09dfc92e4daf' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyInterpreterConfig' is-struct='yes' naming-typedef-id='type-id-154' visibility='default' size-in-bits='224' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='77' column='1' hash='db675c168de195ed' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_main_obmalloc' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='allow_fork' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allow_exec' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='allow_threads' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allow_daemon_threads' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='check_multi_interp_extensions' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gil' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyListObject' is-struct='yes' naming-typedef-id='type-id-156' visibility='default' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/listobject.h' line='10' column='1' hash='e0fb44958a7de985' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-124' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/listobject.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_item' type-id='type-id-33' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/listobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='allocated' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/listobject.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemoryViewObject' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' size-in-bits='1216' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='34' column='1' hash='d99fe34a37a9df36' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-124' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mbuf' type-id='type-id-160' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hash' type-id='type-id-120' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='exports' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='view' type-id='type-id-161' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='weakreflist' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ob_array' type-id='type-id-93' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDescrObject' is-struct='yes' naming-typedef-id='type-id-162' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='43' column='1' hash='778899ad05899bab' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_common' type-id='type-id-137' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='d_method' type-id='type-id-130' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vectorcall' type-id='type-id-82' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodObject' is-struct='yes' naming-typedef-id='type-id-164' visibility='default' size-in-bits='384' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='17' column='1' hash='9287c4ac72c5f484' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='im_func' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='im_self' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='im_weakreflist' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vectorcall' type-id='type-id-82' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PySetObject' is-struct='yes' naming-typedef-id='type-id-166' visibility='default' size-in-bits='1600' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='41' column='1' hash='516d513fd8f8b4c4' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fill' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='used' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mask' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='table' type-id='type-id-168' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='hash' type-id='type-id-120' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='finger' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='smalltable' type-id='type-id-114' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='weakreflist' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PySliceObject' is-struct='yes' naming-typedef-id='type-id-169' visibility='default' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/sliceobject.h' line='28' column='1' hash='9e689a346aecf448' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/sliceobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/sliceobject.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stop' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/sliceobject.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='step' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/sliceobject.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyStatus' is-struct='yes' naming-typedef-id='type-id-171' visibility='default' size-in-bits='256' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='15' column='1' hash='23fff5b6c07e57a9' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_type' type-id='type-id-111' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func' type-id='type-id-5' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='err_msg' type-id='type-id-5' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exitcode' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyTupleObject' is-struct='yes' naming-typedef-id='type-id-173' visibility='default' size-in-bits='256' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/tupleobject.h' line='10' column='1' hash='1dae24acaf42e49f' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-124' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/tupleobject.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_item' type-id='type-id-33' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/tupleobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyUnicodeObject' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' size-in-bits='512' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='167' column='1' hash='21ad0677ea9556f9' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-133' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data' type-id='type-id-177' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyManagedBufferObject' is-struct='yes' naming-typedef-id='type-id-178' visibility='default' size-in-bits='896' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='18' column='1' hash='052bc4b1b9987faf' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exports' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='master' type-id='type-id-161' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='22' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyUnicodeWriter' is-struct='yes' naming-typedef-id='type-id-180' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='494' column='1' hash='6f282be6c0873e8b' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-1' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kind' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='maxchar' type-id='type-id-182' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pos' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='min_length' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='min_char' type-id='type-id-182' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='506' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='overallocate' type-id='type-id-183' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='424'>
        <var-decl name='readonly' type-id='type-id-183' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='513' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyWeakReference' is-struct='yes' visibility='default' size-in-bits='512' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='13' column='1' hash='fedf69190524f01b' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='wr_object' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wr_callback' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hash' type-id='type-id-120' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='wr_prev' type-id='type-id-185' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='wr_next' type-id='type-id-185' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vectorcall' type-id='type-id-82' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/weakrefobject.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_clock_info_t' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' size-in-bits='192' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='245' column='1' hash='206ae787150241c4' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='implementation' type-id='type-id-5' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='monotonic' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='adjustable' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resolution' type-id='type-id-188' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='249' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__TruffleNativeAPI' is-struct='yes' visibility='default' size-in-bits='576' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='86' column='1' hash='f57caf6c6985a82b' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='getTruffleContext' type-id='type-id-190' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='newObjectRef' type-id='type-id-191' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='releaseObjectRef' type-id='type-id-192' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='releaseAndReturn' type-id='type-id-191' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='isSameObject' type-id='type-id-193' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='newClosureRef' type-id='type-id-194' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='releaseClosureRef' type-id='type-id-194' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='getClosureObject' type-id='type-id-195' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='exceptionCheck' type-id='type-id-196' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__TruffleThreadAPI' is-struct='yes' visibility='default' size-in-bits='192' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='216' column='1' hash='20abf5aa04375e01' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='getTruffleEnv' type-id='type-id-198' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attachCurrentThread' type-id='type-id-198' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='detachCurrentThread' type-id='type-id-199' visibility='default' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='230' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_inittab' is-struct='yes' visibility='default' size-in-bits='128' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/import.h' line='29' column='1' hash='7af64a909a8b2ffa' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/import.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='initfunc' type-id='type-id-201' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/import.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_line_offsets' is-struct='yes' visibility='default' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='327' column='1' hash='2c69c28841becdf9' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ar_start' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ar_end' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ar_line' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opaque' type-id='type-id-203' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='331' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_opaque' is-struct='yes' visibility='default' size-in-bits='192' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='321' column='1' hash='4a9878fb38ad6d1e' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='computed_line' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lo_next' type-id='type-id-204' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='limit' type-id='type-id-204' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='324' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='setentry' is-struct='yes' naming-typedef-id='type-id-113' visibility='default' size-in-bits='128' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='25' column='1' hash='0c853127f16f6d4c' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-120' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-207' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timeval.h' line='8' column='1' hash='bc6c194f1d75b24d' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-207' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-210' visibility='default' filepath='/usr/include/bits/types/struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' hash='831fa813c3806379' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wrapperbase' is-struct='yes' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='16' column='1' hash='b76fd2ad8788ca23' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='function' type-id='type-id-1' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wrapper' type-id='type-id-213' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-5' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name_strobj' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='105' column='1' hash='01957afc615d2065#10' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interned' type-id='type-id-14' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='kind' type-id='type-id-14' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='compact' type-id='type-id-14' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='ascii' type-id='type-id-14' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='statically_allocated' type-id='type-id-14' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GCState' type-id='type-id-214' size-in-bits='1920' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.h' line='101' column='1' id='type-id-215'/>
    <typedef-decl name='PyASCIIObject' type-id='type-id-118' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='154' column='1' id='type-id-117'/>
    <typedef-decl name='PyByteArrayObject' type-id='type-id-123' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytearrayobject.h' line='17' column='1' id='type-id-122'/>
    <typedef-decl name='PyBytesObject' type-id='type-id-126' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/bytesobject.h' line='20' column='1' id='type-id-125'/>
    <typedef-decl name='PyCFunctionObject' type-id='type-id-129' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='19' column='1' id='type-id-128'/>
    <typedef-decl name='PyCMethodObject' type-id='type-id-132' size-in-bits='512' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/methodobject.h' line='31' column='1' id='type-id-131'/>
    <typedef-decl name='PyCapsule_Destructor' type-id='type-id-216' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/pycapsule.h' line='27' column='1' hash='fd7a63c0c6c822c4' id='type-id-217'/>
    <typedef-decl name='PyCodeAddressRange' type-id='type-id-202' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='332' column='1' id='type-id-218'/>
    <typedef-decl name='PyCodeEvent' type-id='type-id-98' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='288' column='1' hash='2a657f7f68ef7fbb' id='type-id-97'/>
    <typedef-decl name='PyCode_WatchCallback' type-id='type-id-219' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/code.h' line='300' column='1' hash='fd7a63c0c6c822c4' id='type-id-220'/>
    <typedef-decl name='PyCompactUnicodeObject' type-id='type-id-134' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='164' column='1' id='type-id-133'/>
    <typedef-decl name='PyCompilerFlags' type-id='type-id-136' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/compile.h' line='34' column='1' id='type-id-135'/>
    <typedef-decl name='PyDescrObject' type-id='type-id-138' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='36' column='1' id='type-id-137'/>
    <typedef-decl name='PyDictObject' type-id='type-id-140' size-in-bits='384' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='38' column='1' id='type-id-139'/>
    <typedef-decl name='PyDict_WatchCallback' type-id='type-id-221' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='115' column='1' hash='fd7a63c0c6c822c4' id='type-id-222'/>
    <typedef-decl name='PyDict_WatchEvent' type-id='type-id-101' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='110' column='1' hash='4f871e2f8788a208' id='type-id-100'/>
    <typedef-decl name='PyFunctionObject' type-id='type-id-145' size-in-bits='1152' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='66' column='1' id='type-id-144'/>
    <typedef-decl name='PyFunction_WatchCallback' type-id='type-id-223' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='170' column='1' hash='fd7a63c0c6c822c4' id='type-id-224'/>
    <typedef-decl name='PyFunction_WatchEvent' type-id='type-id-103' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/funcobject.h' line='153' column='1' hash='7d40ab26c654828a' id='type-id-102'/>
    <typedef-decl name='PyGenObject' type-id='type-id-148' size-in-bits='640' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/genobject.h' line='39' column='1' id='type-id-147'/>
    <typedef-decl name='PyInstanceMethodObject' type-id='type-id-153' size-in-bits='192' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='60' column='1' id='type-id-152'/>
    <typedef-decl name='PyInterpreterConfig' type-id='type-id-155' size-in-bits='224' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='86' column='1' id='type-id-154'/>
    <typedef-decl name='PyListObject' type-id='type-id-157' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/listobject.h' line='27' column='1' id='type-id-156'/>
    <typedef-decl name='PyLockStatus' type-id='type-id-104' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/pythread.h' line='21' column='1' hash='77203397064cb822' id='type-id-225'/>
    <typedef-decl name='PyLongObject' type-id='type-id-226' size-in-bits='256' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/pytypedefs.h' line='24' column='1' id='type-id-227'/>
    <typedef-decl name='PyMemAllocatorDomain' type-id='type-id-106' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pymem.h' line='37' column='1' hash='f8accd1edafbed53' id='type-id-105'/>
    <typedef-decl name='PyMemoryViewObject' type-id='type-id-159' size-in-bits='1216' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='43' column='1' id='type-id-158'/>
    <typedef-decl name='PyMethodDescrObject' type-id='type-id-163' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='47' column='1' id='type-id-162'/>
    <typedef-decl name='PyMethodObject' type-id='type-id-165' size-in-bits='384' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/classobject.h' line='23' column='1' id='type-id-164'/>
    <typedef-decl name='PyOS_sighandler_t' type-id='type-id-228' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/pylifecycle.h' line='66' column='1' hash='fd7a63c0c6c822c4' id='type-id-229'/>
    <typedef-decl name='PySetObject' type-id='type-id-167' size-in-bits='1600' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='64' column='1' id='type-id-166'/>
    <typedef-decl name='PySliceObject' type-id='type-id-170' size-in-bits='320' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/sliceobject.h' line='31' column='1' id='type-id-169'/>
    <typedef-decl name='PyStatus' type-id='type-id-172' size-in-bits='256' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/initconfig.h' line='24' column='1' id='type-id-171'/>
    <typedef-decl name='PyTupleObject' type-id='type-id-174' size-in-bits='256' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/tupleobject.h' line='17' column='1' id='type-id-173'/>
    <typedef-decl name='PyType_WatchCallback' type-id='type-id-230' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/object.h' line='572' column='1' hash='fd7a63c0c6c822c4' id='type-id-231'/>
    <typedef-decl name='PyUnicodeObject' type-id='type-id-176' size-in-bits='512' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='175' column='1' id='type-id-175'/>
    <typedef-decl name='PyWeakReference' type-id='type-id-184' size-in-bits='512' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/weakrefobject.h' line='14' column='1' id='type-id-232'/>
    <typedef-decl name='Py_UCS1' type-id='type-id-233' size-in-bits='8' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/unicodeobject.h' line='109' column='1' hash='6ebac62b3366db68' id='type-id-234'/>
    <typedef-decl name='Py_UCS2' type-id='type-id-235' size-in-bits='16' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/unicodeobject.h' line='108' column='1' hash='d7723bb93a30b11d' id='type-id-236'/>
    <typedef-decl name='Py_UNICODE' type-id='type-id-237' size-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='15' column='1' hash='09d17c08f594edc7' id='type-id-238'/>
    <typedef-decl name='TruffleContext' type-id='type-id-239' size-in-bits='64' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='83' column='1' hash='11894d87c9851d83' id='type-id-240'/>
    <typedef-decl name='TruffleEnv' type-id='type-id-241' size-in-bits='64' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='82' column='1' hash='2ef96628aa8c9e9b' id='type-id-242'/>
    <typedef-decl name='_PyManagedBufferObject' type-id='type-id-179' size-in-bits='896' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/memoryobject.h' line='23' column='1' id='type-id-178'/>
    <typedef-decl name='_PyTime_round_t' type-id='type-id-108' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='95' column='1' hash='ca3f652de070b9c2' id='type-id-107'/>
    <typedef-decl name='_PyTime_t' type-id='type-id-243' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='68' column='1' hash='b119fe0931d2ee10' id='type-id-244'/>
    <typedef-decl name='_PyUnicodeWriter' type-id='type-id-181' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='514' column='1' id='type-id-180'/>
    <typedef-decl name='_Py_clock_info_t' type-id='type-id-187' size-in-bits='192' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pytime.h' line='250' column='1' id='type-id-186'/>
    <typedef-decl name='_Py_error_handler' type-id='type-id-110' size-in-bits='32' alignment-in-bits='32' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_fileutils.h' line='33' column='1' hash='7861f53717db66e7' id='type-id-109'/>
    <typedef-decl name='__builtin_va_list' type-id='type-id-96' size-in-bits='192' hash='7d1d3b86b53c983c' id='type-id-245'/>
    <typedef-decl name='__clock_t' type-id='type-id-59' size-in-bits='64' filepath='/usr/include/bits/types.h' line='156' column='1' hash='b119fe0931d2ee10' id='type-id-246'/>
    <typedef-decl name='__gnuc_va_list' type-id='type-id-245' size-in-bits='192' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stdarg.h' line='40' column='1' hash='7d1d3b86b53c983c' id='type-id-247'/>
    <typedef-decl name='__int32_t' type-id='type-id-6' size-in-bits='32' filepath='/usr/include/bits/types.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-248'/>
    <typedef-decl name='__suseconds_t' type-id='type-id-59' size-in-bits='64' filepath='/usr/include/bits/types.h' line='162' column='1' hash='b119fe0931d2ee10' id='type-id-210'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-59' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-208'/>
    <typedef-decl name='__time_t' type-id='type-id-59' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-207'/>
    <typedef-decl name='__uint16_t' type-id='type-id-249' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-250'/>
    <typedef-decl name='atexit_datacallbackfunc' type-id='type-id-251' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/pylifecycle.h' line='114' column='1' hash='fd7a63c0c6c822c4' id='type-id-252'/>
    <typedef-decl name='clock_t' type-id='type-id-246' size-in-bits='64' filepath='/usr/include/bits/types/clock_t.h' line='7' column='1' hash='b119fe0931d2ee10' id='type-id-253'/>
    <typedef-decl name='int32_t' type-id='type-id-248' size-in-bits='32' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='type-id-254'/>
    <typedef-decl name='setentry' type-id='type-id-205' size-in-bits='128' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/setobject.h' line='28' column='1' id='type-id-113'/>
    <typedef-decl name='time_t' type-id='type-id-207' size-in-bits='64' filepath='/usr/include/bits/types/time_t.h' line='10' column='1' hash='b119fe0931d2ee10' id='type-id-255'/>
    <typedef-decl name='uint16_t' type-id='type-id-250' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-235'/>
    <typedef-decl name='va_list' type-id='type-id-247' size-in-bits='192' filepath='/usr/include/stdio.h' line='53' column='1' hash='7d1d3b86b53c983c' id='type-id-256'/>
    <typedef-decl name='wrapperfunc' type-id='type-id-257' size-in-bits='64' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/descrobject.h' line='10' column='1' hash='fd7a63c0c6c822c4' id='type-id-213'/>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='169' column='1' hash='c573eb7a725bef34#2' id='type-id-177'>
      <data-member access='public'>
        <var-decl name='any' type-id='type-id-1' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='170' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='latin1' type-id='type-id-258' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='171' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ucs2' type-id='type-id-259' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='172' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ucs4' type-id='type-id-260' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/unicodeobject.h' line='173' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-261'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' hash='bede2584bd2cf228' id='type-id-262'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='2b8a3e81cffd13f5' id='type-id-263'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' hash='e2509c6c2fd06cfc' id='type-id-62'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' hash='d9c4f1c8136d574e' id='type-id-74'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' hash='469cc23fdf0bfab2' id='type-id-264'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' hash='7e6a958c84def842' id='type-id-265'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-267'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='2609f55dff74dfb5' id='type-id-268'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-270'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-272'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-274'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' hash='609beb17c1aad223' id='type-id-275'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' hash='243b782751d0c23d' id='type-id-277'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' hash='46bc5138592825c5' id='type-id-278'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' hash='8efa278643777b1e' id='type-id-279'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-281'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-283'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-285'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-287'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='58845c6cf7dad1e8' id='type-id-288'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' hash='88039e399aef5de3' id='type-id-289'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' hash='fe3236eefa3ce39d' id='type-id-290'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' hash='97267f7dd4b39e75' id='type-id-291'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='10a23afeebb7488b' id='type-id-292'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='beae3a9a52880470' id='type-id-294'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' hash='a5bfc72d6db0ca44' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-299'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-303'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' hash='68274559f73d51ba' id='type-id-304'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' hash='5e5e943b3b21cc78' id='type-id-305'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-307'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-309'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-311'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-313'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-315'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-317'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-319'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-321'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-322'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-324'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-326'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-328'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-329'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-330'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-332'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-333'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-334'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-257'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-337'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-338'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-339'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-341'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-343'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-345'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-347'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-348'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-350'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-351'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-352'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-354'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-356'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-358'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-359'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-361'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-362'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-363'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-365'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-367'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-369'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-370'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-372'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-374'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-376'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-378'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-380'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-382'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-384'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-386'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-388'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-390'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-392'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-394'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-396'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-398'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-400'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-402'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-404'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='fd7a63c0c6c822c4#2' id='type-id-405'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' hash='fd7a63c0c6c822c4#3' id='type-id-407'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-408'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-409'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' hash='fd7a63c0c6c822c4#2' id='type-id-411'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-413'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-415'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-417'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-419'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-421'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-423'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-425'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-427'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-429'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-431'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' hash='2a5589558fe359b5' id='type-id-433'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' hash='ac197fea4aa47d3b' id='type-id-435'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='a2a9447902f89f42' id='type-id-436'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' hash='2e8b840b50079d96' id='type-id-437'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-438'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-440'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='4ad6dc1875430d58' id='type-id-441'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-443'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' hash='0f6f20bb6c5c643a' id='type-id-445'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' hash='d1096956bfd9621d' id='type-id-446'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-448'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-450'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-451'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-453'/>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-455'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='eeddfde03e791606' id='type-id-456'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' hash='728a5a70c3c22e81' id='type-id-185'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' hash='4aa98aadfcf79377' id='type-id-458'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='65c12b2f86feb5b4' id='type-id-258'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' hash='35a2393a74bc0c05' id='type-id-259'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-460'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' hash='ad952ee7d86c7461' id='type-id-260'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' hash='30a7c107de057685' id='type-id-461'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-463'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-465'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-467'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-469'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-470'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-472'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-474'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-475'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-477'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-479'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-481'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-483'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-485'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' hash='27434bc40f585943' id='type-id-486'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-190'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' hash='1dff780737b0ce60' id='type-id-488'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-198'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-191'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-195'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' hash='8de911da31060db7' id='type-id-160'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' hash='f45255af685ba9d1' id='type-id-492'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' hash='2dea0aaf6ee18849' id='type-id-493'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' hash='2dcb3951762e3d89' id='type-id-495'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' hash='763a11a8afea49fb' id='type-id-496'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-498'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='5417bfa2d92068d6' id='type-id-499'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-196'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-501'/>
    <qualified-type-def type-id='type-id-276' const='yes' hash='3eb45c3c87aee062' id='type-id-502'/>
    <pointer-type-def type-id='type-id-502' size-in-bits='64' hash='d89daceed19e92d6' id='type-id-503'/>
    <qualified-type-def type-id='type-id-154' const='yes' hash='667e6f632d19fee0' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' hash='a1e8f5a842718014' id='type-id-505'/>
    <qualified-type-def type-id='type-id-227' const='yes' hash='4bc2cc35a22617f3' id='type-id-506'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' hash='bb97286a8f3addf4' id='type-id-507'/>
    <qualified-type-def type-id='type-id-434' const='yes' hash='bc1665bc89b9fef6' id='type-id-508'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' hash='aa3e671cc91a43f6' id='type-id-509'/>
    <qualified-type-def type-id='type-id-161' const='yes' hash='4f573491bd5a53e9' id='type-id-510'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' hash='13f8ca305bed7d7b' id='type-id-31'/>
    <qualified-type-def type-id='type-id-189' const='yes' hash='c8bb9cbe8b793974' id='type-id-511'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' hash='2ef96628aa8c9e9b' id='type-id-241'/>
    <qualified-type-def type-id='type-id-197' const='yes' hash='7406f6072ae6a7f7' id='type-id-512'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' hash='11894d87c9851d83' id='type-id-239'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-514'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-516'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-518'/>
    <pointer-type-def type-id='type-id-519' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-520'/>
    <qualified-type-def type-id='type-id-5' restrict='yes' hash='b7d5472019e79b5f' id='type-id-521'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-28'/>
    <qualified-type-def type-id='type-id-233' const='yes' hash='5a6582fbecdbfc78' id='type-id-522'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-204'/>
    <qualified-type-def type-id='type-id-183' const='yes' hash='645f4d0d44563fc6' id='type-id-523'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-524'/>
    <qualified-type-def type-id='type-id-237' const='yes' hash='ec486fb00a2b9a49' id='type-id-525'/>
    <pointer-type-def type-id='type-id-525' size-in-bits='64' hash='7ae0d48e9d921c08' id='type-id-526'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' hash='b17ffc9fda6b3e42' id='type-id-528'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-530'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-532'/>
    <pointer-type-def type-id='type-id-533' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-219'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-535'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-221'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-538'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-223'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-541'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-543'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-545'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-547'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-548'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-550'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-552'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-554'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-555'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-556'/>
    <pointer-type-def type-id='type-id-557' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-558'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-560'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-230'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-563'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-565'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-567'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-569'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-193'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-572'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-574'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-576'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-578'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-580'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-582'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-584'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-586'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' hash='e24def43c7e4b3b5' id='type-id-587'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' hash='9e5ac2431feea35a' id='type-id-589'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-591'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='9525b6affe75cc9d#2' id='type-id-592'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-594'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' hash='5abacdf3fa2972fa' id='type-id-168'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-596'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-598'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-600'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-601'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' hash='784a05f2083b5c30' id='type-id-602'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' hash='abfdebaa4180c5b7' id='type-id-603'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' hash='5f318e120e3d3e21' id='type-id-604'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' hash='0450557ac0931bcf' id='type-id-605'/>
    <pointer-type-def type-id='type-id-606' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-607'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' hash='f0221758ecf0c0cb' id='type-id-608'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-610'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-612'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' hash='e01340f548ae75f1' id='type-id-88'/>
    <pointer-type-def type-id='type-id-613' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-614'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-615'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-617'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-619'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-621'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-623'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-624'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-625'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-627'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-629'/>
    <pointer-type-def type-id='type-id-630' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-631'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-633'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-635'/>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-199'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-192'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-194'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-640'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-642'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-228'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-645'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-647'/>
    <pointer-type-def type-id='type-id-648' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-649'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-651'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-652'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-654'/>
    <pointer-type-def type-id='type-id-655' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-656'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-658'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-660'/>
    <pointer-type-def type-id='type-id-661' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-662'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-664'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-666'/>
    <qualified-type-def type-id='type-id-667' const='yes' hash='770b416d4a314d6d' id='type-id-668'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' hash='3e589a5e839e4438' id='type-id-669'/>
    <pointer-type-def type-id='type-id-670' size-in-bits='64' hash='c8355f5d4d517bab' id='type-id-671'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' hash='25fc496c84d53f6a' id='type-id-672'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' id='type-id-676'/>
    <class-decl name='_PyInterpreterFrame' is-struct='yes' visibility='default' size-in-bits='640' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='56' column='1' hash='957f1839549e60d0' id='type-id-677'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_code' type-id='type-id-678' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='previous' type-id='type-id-679' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_funcobj' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_globals' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_builtins' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_locals' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='frame_obj' type-id='type-id-680' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='prev_instr' type-id='type-id-681' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stacktop' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='return_offset' type-id='type-id-235' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='owner' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='localsplus' type-id='type-id-151' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__TruffleObject' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-675'/>
    <class-decl name='_dictkeysobject' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-682'/>
    <class-decl name='_dictvalues' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-683'/>
    <class-decl name='_frame' is-struct='yes' visibility='default' size-in-bits='448' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='21' column='1' hash='f674ef6d2e659014' id='type-id-684'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-119' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_back' type-id='type-id-680' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_frame' type-id='type-id-679' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_trace' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_lineno' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='f_trace_lines' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='f_trace_opcodes' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='f_fast_as_locals' type-id='type-id-32' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_f_frame_data' type-id='type-id-151' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_frame.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_is' is-struct='yes' visibility='default' size-in-bits='879552' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='88' column='1' hash='cc10d2fa072d1ef4' id='type-id-685'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-686' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-243' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id_refcount' type-id='type-id-243' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='requires_idref' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='id_mutex' type-id='type-id-687' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_initialized' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='finalizing' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='monitoring_version' type-id='type-id-141' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='last_restart_version' type-id='type-id-141' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='threads' type-id='type-id-688' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='runtime' type-id='type-id-689' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_finalizing' type-id='type-id-690' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='gc' type-id='type-id-214' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='sysdict' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='builtins' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='codec_search_path' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='codec_search_cache' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='codec_error_registry' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='codecs_initialized' type-id='type-id-6' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='config' type-id='type-id-276' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='feature_flags' type-id='type-id-13' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='dict' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='sysdict_copy' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='builtins_copy' type-id='type-id-3' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='eval_frame' type-id='type-id-691' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='dtoa' type-id='type-id-692' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26048'>
        <var-decl name='types' type-id='type-id-693' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876608'>
        <var-decl name='interpreter_trampoline' type-id='type-id-678' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876672'>
        <var-decl name='f_opcode_trace_set' type-id='type-id-694' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876680'>
        <var-decl name='sys_profile_initialized' type-id='type-id-694' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876688'>
        <var-decl name='sys_trace_initialized' type-id='type-id-694' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876736'>
        <var-decl name='sys_profiling_threads' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876800'>
        <var-decl name='sys_tracing_threads' type-id='type-id-4' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876864'>
        <var-decl name='xidregistry' type-id='type-id-695' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='876992'>
        <var-decl name='threads_main' type-id='type-id-21' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='877056'>
        <var-decl name='_finalizing_id' type-id='type-id-690' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='877120'>
        <var-decl name='_initial_thread' type-id='type-id-696' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/internal/pycore_interp.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-697'/>
    <typedef-decl name='TruffleObject' type-id='type-id-676' size-in-bits='64' filepath='./graal/truffle/src/com.oracle.truffle.nfi.native/include/trufflenfi.h' line='49' column='1' id='type-id-698'/>
    <typedef-decl name='PyDictKeysObject' type-id='type-id-682' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='10' column='1' id='type-id-673'/>
    <typedef-decl name='PyDictValues' type-id='type-id-683' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/cpython/dictobject.h' line='11' column='1' id='type-id-674'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-1' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/include/pythread.h' line='9' column='1' id='type-id-444'/>
    <var-decl name='Arraytype' type-id='type-id-699' mangled-name='Arraytype' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='Arraytype'/>
    <var-decl name='PyArrayIter_Type' type-id='type-id-699' mangled-name='PyArrayIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyArrayIter_Type'/>
    <var-decl name='PyAsyncGen_Type' type-id='type-id-699' mangled-name='PyAsyncGen_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyAsyncGen_Type'/>
    <var-decl name='PyBaseObject_Type' type-id='type-id-699' mangled-name='PyBaseObject_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyBaseObject_Type'/>
    <var-decl name='PyBool_Type' type-id='type-id-699' mangled-name='PyBool_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyBool_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-699' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-699' mangled-name='PyByteArray_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-699' mangled-name='PyBytesIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <var-decl name='PyBytes_Type' type-id='type-id-699' mangled-name='PyBytes_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyBytes_Type'/>
    <var-decl name='PyCArrayType_Type' type-id='type-id-699' mangled-name='PyCArrayType_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCArrayType_Type'/>
    <var-decl name='PyCData_Type' type-id='type-id-699' mangled-name='PyCData_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCData_Type'/>
    <var-decl name='PyCFunction_Type' type-id='type-id-699' mangled-name='PyCFunction_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCFunction_Type'/>
    <var-decl name='PyCMethod_Type' type-id='type-id-699' mangled-name='PyCMethod_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCMethod_Type'/>
    <var-decl name='PyCPointerType_Type' type-id='type-id-699' mangled-name='PyCPointerType_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCPointerType_Type'/>
    <var-decl name='PyCSimpleType' type-id='type-id-699' mangled-name='PyCSimpleType' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCSimpleType'/>
    <var-decl name='PyCStructType_Type' type-id='type-id-699' mangled-name='PyCStructType_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCStructType_Type'/>
    <var-decl name='PyCallIter_Type' type-id='type-id-699' mangled-name='PyCallIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCallIter_Type'/>
    <var-decl name='PyCapsule_Type' type-id='type-id-699' mangled-name='PyCapsule_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCapsule_Type'/>
    <var-decl name='PyCell_Type' type-id='type-id-699' mangled-name='PyCell_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCell_Type'/>
    <var-decl name='PyClassMethodDescr_Type' type-id='type-id-699' mangled-name='PyClassMethodDescr_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyClassMethodDescr_Type'/>
    <var-decl name='PyClassMethod_Type' type-id='type-id-699' mangled-name='PyClassMethod_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyClassMethod_Type'/>
    <var-decl name='PyCmpWrapper_Type' type-id='type-id-699' mangled-name='PyCmpWrapper_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCmpWrapper_Type'/>
    <var-decl name='PyCode_Type' type-id='type-id-699' mangled-name='PyCode_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCode_Type'/>
    <var-decl name='PyComplex_Type' type-id='type-id-699' mangled-name='PyComplex_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyComplex_Type'/>
    <var-decl name='PyContextToken_Type' type-id='type-id-699' mangled-name='PyContextToken_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyContextToken_Type'/>
    <var-decl name='PyContextVar_Type' type-id='type-id-699' mangled-name='PyContextVar_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyContextVar_Type'/>
    <var-decl name='PyContext_Type' type-id='type-id-699' mangled-name='PyContext_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyContext_Type'/>
    <var-decl name='PyCoro_Type' type-id='type-id-699' mangled-name='PyCoro_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyCoro_Type'/>
    <var-decl name='PyDictItems_Type' type-id='type-id-699' mangled-name='PyDictItems_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictItems_Type'/>
    <var-decl name='PyDictIterItem_Type' type-id='type-id-699' mangled-name='PyDictIterItem_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictIterItem_Type'/>
    <var-decl name='PyDictIterKey_Type' type-id='type-id-699' mangled-name='PyDictIterKey_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictIterKey_Type'/>
    <var-decl name='PyDictIterValue_Type' type-id='type-id-699' mangled-name='PyDictIterValue_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictIterValue_Type'/>
    <var-decl name='PyDictKeys_Type' type-id='type-id-699' mangled-name='PyDictKeys_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictKeys_Type'/>
    <var-decl name='PyDictProxy_Type' type-id='type-id-699' mangled-name='PyDictProxy_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictProxy_Type'/>
    <var-decl name='PyDictRevIterItem_Type' type-id='type-id-699' mangled-name='PyDictRevIterItem_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictRevIterItem_Type'/>
    <var-decl name='PyDictRevIterKey_Type' type-id='type-id-699' mangled-name='PyDictRevIterKey_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictRevIterKey_Type'/>
    <var-decl name='PyDictRevIterValue_Type' type-id='type-id-699' mangled-name='PyDictRevIterValue_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictRevIterValue_Type'/>
    <var-decl name='PyDictValues_Type' type-id='type-id-699' mangled-name='PyDictValues_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyDictValues_Type'/>
    <var-decl name='PyEllipsis_Type' type-id='type-id-699' mangled-name='PyEllipsis_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyEllipsis_Type'/>
    <var-decl name='PyEnum_Type' type-id='type-id-699' mangled-name='PyEnum_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyEnum_Type'/>
    <var-decl name='PyFilter_Type' type-id='type-id-699' mangled-name='PyFilter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyFilter_Type'/>
    <var-decl name='PyFloat_Type' type-id='type-id-699' mangled-name='PyFloat_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyFloat_Type'/>
    <var-decl name='PyFrame_Type' type-id='type-id-699' mangled-name='PyFrame_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyFrame_Type'/>
    <var-decl name='PyFrozenSet_Type' type-id='type-id-699' mangled-name='PyFrozenSet_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyFrozenSet_Type'/>
    <var-decl name='PyFunction_Type' type-id='type-id-699' mangled-name='PyFunction_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyFunction_Type'/>
    <var-decl name='PyGen_Type' type-id='type-id-699' mangled-name='PyGen_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyGen_Type'/>
    <var-decl name='PyGetSetDescr_Type' type-id='type-id-699' mangled-name='PyGetSetDescr_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyGetSetDescr_Type'/>
    <var-decl name='PyInstanceMethod_Type' type-id='type-id-699' mangled-name='PyInstanceMethod_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyInstanceMethod_Type'/>
    <var-decl name='PyListIter_Type' type-id='type-id-699' mangled-name='PyListIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyListIter_Type'/>
    <var-decl name='PyListRevIter_Type' type-id='type-id-699' mangled-name='PyListRevIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyListRevIter_Type'/>
    <var-decl name='PyLongRangeIter_Type' type-id='type-id-699' mangled-name='PyLongRangeIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyLongRangeIter_Type'/>
    <var-decl name='PyLong_Type' type-id='type-id-699' mangled-name='PyLong_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyLong_Type'/>
    <var-decl name='PyMap_Type' type-id='type-id-699' mangled-name='PyMap_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyMap_Type'/>
    <var-decl name='PyMemberDescr_Type' type-id='type-id-699' mangled-name='PyMemberDescr_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyMemberDescr_Type'/>
    <var-decl name='PyMemoryView_Type' type-id='type-id-699' mangled-name='PyMemoryView_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyMemoryView_Type'/>
    <var-decl name='PyMethodDescr_Type' type-id='type-id-699' mangled-name='PyMethodDescr_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyMethodDescr_Type'/>
    <var-decl name='PyMethod_Type' type-id='type-id-699' mangled-name='PyMethod_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyMethod_Type'/>
    <var-decl name='PyModuleDef_Type' type-id='type-id-699' mangled-name='PyModuleDef_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyModuleDef_Type'/>
    <var-decl name='PyNullImporter_Type' type-id='type-id-699' mangled-name='PyNullImporter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyNullImporter_Type'/>
    <var-decl name='PyODictItems_Type' type-id='type-id-699' mangled-name='PyODictItems_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyODictItems_Type'/>
    <var-decl name='PyODictIter_Type' type-id='type-id-699' mangled-name='PyODictIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyODictIter_Type'/>
    <var-decl name='PyODictKeys_Type' type-id='type-id-699' mangled-name='PyODictKeys_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyODictKeys_Type'/>
    <var-decl name='PyODictValues_Type' type-id='type-id-699' mangled-name='PyODictValues_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyODictValues_Type'/>
    <var-decl name='PyODict_Type' type-id='type-id-699' mangled-name='PyODict_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyODict_Type'/>
    <var-decl name='PyPickleBuffer_Type' type-id='type-id-699' mangled-name='PyPickleBuffer_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyPickleBuffer_Type'/>
    <var-decl name='PyProperty_Type' type-id='type-id-699' mangled-name='PyProperty_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyProperty_Type'/>
    <var-decl name='PyRangeIter_Type' type-id='type-id-699' mangled-name='PyRangeIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyRangeIter_Type'/>
    <var-decl name='PyRange_Type' type-id='type-id-699' mangled-name='PyRange_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyRange_Type'/>
    <var-decl name='PyReversed_Type' type-id='type-id-699' mangled-name='PyReversed_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyReversed_Type'/>
    <var-decl name='PySTEntry_Type' type-id='type-id-699' mangled-name='PySTEntry_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PySTEntry_Type'/>
    <var-decl name='PySeqIter_Type' type-id='type-id-699' mangled-name='PySeqIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PySeqIter_Type'/>
    <var-decl name='PySetIter_Type' type-id='type-id-699' mangled-name='PySetIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PySetIter_Type'/>
    <var-decl name='PySet_Type' type-id='type-id-699' mangled-name='PySet_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PySet_Type'/>
    <var-decl name='PySortWrapper_Type' type-id='type-id-699' mangled-name='PySortWrapper_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PySortWrapper_Type'/>
    <var-decl name='PyStaticMethod_Type' type-id='type-id-699' mangled-name='PyStaticMethod_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyStaticMethod_Type'/>
    <var-decl name='PyStdPrinter_Type' type-id='type-id-699' mangled-name='PyStdPrinter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyStdPrinter_Type'/>
    <var-decl name='PySuper_Type' type-id='type-id-699' mangled-name='PySuper_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PySuper_Type'/>
    <var-decl name='PyTraceBack_Type' type-id='type-id-699' mangled-name='PyTraceBack_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyTraceBack_Type'/>
    <var-decl name='PyTupleIter_Type' type-id='type-id-699' mangled-name='PyTupleIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyTupleIter_Type'/>
    <var-decl name='PyUnicodeIter_Type' type-id='type-id-699' mangled-name='PyUnicodeIter_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyUnicodeIter_Type'/>
    <var-decl name='PyUnicode_Type' type-id='type-id-699' mangled-name='PyUnicode_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyUnicode_Type'/>
    <var-decl name='PyWrapperDescr_Type' type-id='type-id-699' mangled-name='PyWrapperDescr_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyWrapperDescr_Type'/>
    <var-decl name='PyZip_Type' type-id='type-id-699' mangled-name='PyZip_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='PyZip_Type'/>
    <var-decl name='Py_GenericAliasType' type-id='type-id-699' mangled-name='Py_GenericAliasType' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='Py_GenericAliasType'/>
    <var-decl name='Simple_Type' type-id='type-id-699' mangled-name='Simple_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='Simple_Type'/>
    <var-decl name='UnionType_Type' type-id='type-id-699' mangled-name='UnionType_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='UnionType_Type'/>
    <var-decl name='_PyAIterWrapper_Type' type-id='type-id-699' mangled-name='_PyAIterWrapper_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyAIterWrapper_Type'/>
    <var-decl name='_PyAsyncGenASend_Type' type-id='type-id-699' mangled-name='_PyAsyncGenASend_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyAsyncGenASend_Type'/>
    <var-decl name='_PyAsyncGenAThrow_Type' type-id='type-id-699' mangled-name='_PyAsyncGenAThrow_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyAsyncGenAThrow_Type'/>
    <var-decl name='_PyAsyncGenWrappedValue_Type' type-id='type-id-699' mangled-name='_PyAsyncGenWrappedValue_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyAsyncGenWrappedValue_Type'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-699' mangled-name='_PyBytesIOBuffer_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyBytesIOBuffer_Type'/>
    <var-decl name='_PyCoroWrapper_Type' type-id='type-id-699' mangled-name='_PyCoroWrapper_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyCoroWrapper_Type'/>
    <var-decl name='_PyExc_BaseException' type-id='type-id-699' mangled-name='_PyExc_BaseException' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyExc_BaseException'/>
    <var-decl name='_PyExc_Exception' type-id='type-id-699' mangled-name='_PyExc_Exception' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyExc_Exception'/>
    <var-decl name='_PyExc_StopIteration' type-id='type-id-699' mangled-name='_PyExc_StopIteration' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyExc_StopIteration'/>
    <var-decl name='_PyHamtItems_Type' type-id='type-id-699' mangled-name='_PyHamtItems_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamtItems_Type'/>
    <var-decl name='_PyHamtKeys_Type' type-id='type-id-699' mangled-name='_PyHamtKeys_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamtKeys_Type'/>
    <var-decl name='_PyHamtValues_Type' type-id='type-id-699' mangled-name='_PyHamtValues_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamtValues_Type'/>
    <var-decl name='_PyHamt_ArrayNode_Type' type-id='type-id-699' mangled-name='_PyHamt_ArrayNode_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamt_ArrayNode_Type'/>
    <var-decl name='_PyHamt_BitmapNode_Type' type-id='type-id-699' mangled-name='_PyHamt_BitmapNode_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamt_BitmapNode_Type'/>
    <var-decl name='_PyHamt_CollisionNode_Type' type-id='type-id-699' mangled-name='_PyHamt_CollisionNode_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamt_CollisionNode_Type'/>
    <var-decl name='_PyHamt_Type' type-id='type-id-699' mangled-name='_PyHamt_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyHamt_Type'/>
    <var-decl name='_PyInterpreterID_Type' type-id='type-id-699' mangled-name='_PyInterpreterID_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyInterpreterID_Type'/>
    <var-decl name='_PyManagedBuffer_Type' type-id='type-id-699' mangled-name='_PyManagedBuffer_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyManagedBuffer_Type'/>
    <var-decl name='_PyMethodWrapper_Type' type-id='type-id-699' mangled-name='_PyMethodWrapper_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyMethodWrapper_Type'/>
    <var-decl name='_PyNamespace_Type' type-id='type-id-699' mangled-name='_PyNamespace_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyNamespace_Type'/>
    <var-decl name='_PyNone_Type' type-id='type-id-699' mangled-name='_PyNone_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyNone_Type'/>
    <var-decl name='_PyNotImplemented_Type' type-id='type-id-699' mangled-name='_PyNotImplemented_Type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyNotImplemented_Type'/>
    <var-decl name='_PyWeakref_CallableProxyType' type-id='type-id-699' mangled-name='_PyWeakref_CallableProxyType' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyWeakref_CallableProxyType'/>
    <var-decl name='_PyWeakref_ProxyType' type-id='type-id-699' mangled-name='_PyWeakref_ProxyType' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyWeakref_ProxyType'/>
    <var-decl name='_PyWeakref_RefType' type-id='type-id-699' mangled-name='_PyWeakref_RefType' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='_PyWeakref_RefType'/>
    <var-decl name='cycle_type' type-id='type-id-699' mangled-name='cycle_type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='cycle_type'/>
    <var-decl name='mmap_object_type' type-id='type-id-699' mangled-name='mmap_object_type' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='192' column='1' elf-symbol-id='mmap_object_type'/>
    <var-decl name='GraalPyPrivate_Upcall_PyCapsule_GetDestructor' type-id='type-id-267' mangled-name='GraalPyPrivate_Upcall_PyCapsule_GetDestructor' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyCapsule_GetDestructor'/>
    <var-decl name='GraalPyPrivate_Upcall_PyCode_NewEmpty' type-id='type-id-272' mangled-name='GraalPyPrivate_Upcall_PyCode_NewEmpty' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyCode_NewEmpty'/>
    <var-decl name='GraalPyPrivate_Upcall_PyFrame_GetCode' type-id='type-id-270' mangled-name='GraalPyPrivate_Upcall_PyFrame_GetCode' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyFrame_GetCode'/>
    <var-decl name='GraalPyPrivate_Upcall_PyUnstable_Code_NewWithPosOnlyArgs' type-id='type-id-274' mangled-name='GraalPyPrivate_Upcall_PyUnstable_Code_NewWithPosOnlyArgs' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyUnstable_Code_NewWithPosOnlyArgs'/>
    <var-decl name='GraalPyPrivate_Upcall_PyEval_GetFrame' type-id='type-id-287' mangled-name='GraalPyPrivate_Upcall_PyEval_GetFrame' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyEval_GetFrame'/>
    <var-decl name='GraalPyPrivate_Upcall_PyFrame_GetBack' type-id='type-id-281' mangled-name='GraalPyPrivate_Upcall_PyFrame_GetBack' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyFrame_GetBack'/>
    <var-decl name='GraalPyPrivate_Upcall_PyFrame_New' type-id='type-id-285' mangled-name='GraalPyPrivate_Upcall_PyFrame_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyFrame_New'/>
    <var-decl name='GraalPyPrivate_Upcall_PyThreadState_GetFrame' type-id='type-id-283' mangled-name='GraalPyPrivate_Upcall_PyThreadState_GetFrame' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyThreadState_GetFrame'/>
    <var-decl name='GraalPyPrivate_Get_PyCFunctionObject_m_ml' type-id='type-id-297' mangled-name='GraalPyPrivate_Get_PyCFunctionObject_m_ml' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyCFunctionObject_m_ml'/>
    <var-decl name='GraalPyPrivate_Get_PyMethodDescrObject_d_method' type-id='type-id-301' mangled-name='GraalPyPrivate_Get_PyMethodDescrObject_d_method' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyMethodDescrObject_d_method'/>
    <var-decl name='GraalPyPrivate_Get_PyModuleDef_m_methods' type-id='type-id-303' mangled-name='GraalPyPrivate_Get_PyModuleDef_m_methods' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyModuleDef_m_methods'/>
    <var-decl name='GraalPyPrivate_Set_PyCFunctionObject_m_ml' type-id='type-id-299' mangled-name='GraalPyPrivate_Set_PyCFunctionObject_m_ml' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Set_PyCFunctionObject_m_ml'/>
    <var-decl name='GraalPyPrivate_Get_PyModuleObject_md_def' type-id='type-id-700' mangled-name='GraalPyPrivate_Get_PyModuleObject_md_def' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyModuleObject_md_def'/>
    <var-decl name='GraalPyPrivate_Module_CreateInitialized_PyModule_New' type-id='type-id-701' mangled-name='GraalPyPrivate_Module_CreateInitialized_PyModule_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Module_CreateInitialized_PyModule_New'/>
    <var-decl name='GraalPyPrivate_ByteArray_EmptyWithCapacity' type-id='type-id-359' mangled-name='GraalPyPrivate_ByteArray_EmptyWithCapacity' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_ByteArray_EmptyWithCapacity'/>
    <var-decl name='GraalPyPrivate_ByteArray_FromStringAndSize' type-id='type-id-370' mangled-name='GraalPyPrivate_ByteArray_FromStringAndSize' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_ByteArray_FromStringAndSize'/>
    <var-decl name='GraalPyPrivate_Bytes_Concat' type-id='type-id-702' mangled-name='GraalPyPrivate_Bytes_Concat' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Bytes_Concat'/>
    <var-decl name='GraalPyPrivate_Bytes_EmptyWithCapacity' type-id='type-id-405' mangled-name='GraalPyPrivate_Bytes_EmptyWithCapacity' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Bytes_EmptyWithCapacity'/>
    <var-decl name='GraalPyPrivate_Bytes_FromFormat' type-id='type-id-363' mangled-name='GraalPyPrivate_Bytes_FromFormat' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Bytes_FromFormat'/>
    <var-decl name='GraalPyPrivate_Bytes_FromStringAndSize' type-id='type-id-370' mangled-name='GraalPyPrivate_Bytes_FromStringAndSize' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Bytes_FromStringAndSize'/>
    <var-decl name='GraalPyPrivate_CMethod_NewEx' type-id='type-id-319' mangled-name='GraalPyPrivate_CMethod_NewEx' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_CMethod_NewEx'/>
    <var-decl name='GraalPyPrivate_Compute_Mro' type-id='type-id-358' mangled-name='GraalPyPrivate_Compute_Mro' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Compute_Mro'/>
    <var-decl name='GraalPyPrivate_ContextVar_Get' type-id='type-id-257' mangled-name='GraalPyPrivate_ContextVar_Get' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_ContextVar_Get'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_DateTime_FromDateAndTime' type-id='type-id-402' mangled-name='GraalPyPrivate_DateTimeCAPI_DateTime_FromDateAndTime' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_DateTime_FromDateAndTime'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_DateTime_FromDateAndTimeAndFold' type-id='type-id-404' mangled-name='GraalPyPrivate_DateTimeCAPI_DateTime_FromDateAndTimeAndFold' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_DateTime_FromDateAndTimeAndFold'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_DateTime_FromTimestamp' type-id='type-id-703' mangled-name='GraalPyPrivate_DateTimeCAPI_DateTime_FromTimestamp' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_DateTime_FromTimestamp'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_Date_FromDate' type-id='type-id-394' mangled-name='GraalPyPrivate_DateTimeCAPI_Date_FromDate' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_Date_FromDate'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_Date_FromTimestamp' type-id='type-id-702' mangled-name='GraalPyPrivate_DateTimeCAPI_Date_FromTimestamp' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_Date_FromTimestamp'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_Delta_FromDelta' type-id='type-id-400' mangled-name='GraalPyPrivate_DateTimeCAPI_Delta_FromDelta' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_Delta_FromDelta'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_TimeZone_FromTimeZone' type-id='type-id-702' mangled-name='GraalPyPrivate_DateTimeCAPI_TimeZone_FromTimeZone' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_TimeZone_FromTimeZone'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_Time_FromTime' type-id='type-id-396' mangled-name='GraalPyPrivate_DateTimeCAPI_Time_FromTime' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_Time_FromTime'/>
    <var-decl name='GraalPyPrivate_DateTimeCAPI_Time_FromTimeAndFold' type-id='type-id-398' mangled-name='GraalPyPrivate_DateTimeCAPI_Time_FromTimeAndFold' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_DateTimeCAPI_Time_FromTimeAndFold'/>
    <var-decl name='GraalPyPrivate_Descr_NewClassMethod' type-id='type-id-425' mangled-name='GraalPyPrivate_Descr_NewClassMethod' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Descr_NewClassMethod'/>
    <var-decl name='GraalPyPrivate_Descr_NewGetSet' type-id='type-id-369' mangled-name='GraalPyPrivate_Descr_NewGetSet' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Descr_NewGetSet'/>
    <var-decl name='GraalPyPrivate_Ellipsis' type-id='type-id-201' mangled-name='GraalPyPrivate_Ellipsis' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Ellipsis'/>
    <var-decl name='GraalPyPrivate_Err_GetExcInfo' type-id='type-id-201' mangled-name='GraalPyPrivate_Err_GetExcInfo' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Err_GetExcInfo'/>
    <var-decl name='GraalPyPrivate_Err_Warn' type-id='type-id-333' mangled-name='GraalPyPrivate_Err_Warn' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Err_Warn'/>
    <var-decl name='GraalPyPrivate_Err_WarnExplicit' type-id='type-id-330' mangled-name='GraalPyPrivate_Err_WarnExplicit' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Err_WarnExplicit'/>
    <var-decl name='GraalPyPrivate_Eval_EvalCodeEx' type-id='type-id-324' mangled-name='GraalPyPrivate_Eval_EvalCodeEx' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Eval_EvalCodeEx'/>
    <var-decl name='GraalPyPrivate_False' type-id='type-id-201' mangled-name='GraalPyPrivate_False' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_False'/>
    <var-decl name='GraalPyPrivate_FileSystemDefaultEncoding' type-id='type-id-201' mangled-name='GraalPyPrivate_FileSystemDefaultEncoding' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_FileSystemDefaultEncoding'/>
    <var-decl name='GraalPyPrivate_Get_PyCFunctionObject_m_module' type-id='type-id-307' mangled-name='GraalPyPrivate_Get_PyCFunctionObject_m_module' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyCFunctionObject_m_module'/>
    <var-decl name='GraalPyPrivate_Get_PyCFunctionObject_m_self' type-id='type-id-307' mangled-name='GraalPyPrivate_Get_PyCFunctionObject_m_self' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyCFunctionObject_m_self'/>
    <var-decl name='GraalPyPrivate_Get_PyCFunctionObject_m_weakreflist' type-id='type-id-307' mangled-name='GraalPyPrivate_Get_PyCFunctionObject_m_weakreflist' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyCFunctionObject_m_weakreflist'/>
    <var-decl name='GraalPyPrivate_Get_PyDescrObject_d_name' type-id='type-id-311' mangled-name='GraalPyPrivate_Get_PyDescrObject_d_name' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyDescrObject_d_name'/>
    <var-decl name='GraalPyPrivate_Get_PyInstanceMethodObject_func' type-id='type-id-315' mangled-name='GraalPyPrivate_Get_PyInstanceMethodObject_func' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyInstanceMethodObject_func'/>
    <var-decl name='GraalPyPrivate_Get_PyMethodObject_im_func' type-id='type-id-321' mangled-name='GraalPyPrivate_Get_PyMethodObject_im_func' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyMethodObject_im_func'/>
    <var-decl name='GraalPyPrivate_Get_PyMethodObject_im_self' type-id='type-id-321' mangled-name='GraalPyPrivate_Get_PyMethodObject_im_self' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyMethodObject_im_self'/>
    <var-decl name='GraalPyPrivate_Get_PyModuleObject_md_dict' type-id='type-id-704' mangled-name='GraalPyPrivate_Get_PyModuleObject_md_dict' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PyModuleObject_md_dict'/>
    <var-decl name='GraalPyPrivate_Get_PySliceObject_start' type-id='type-id-350' mangled-name='GraalPyPrivate_Get_PySliceObject_start' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PySliceObject_start'/>
    <var-decl name='GraalPyPrivate_Get_PySliceObject_step' type-id='type-id-350' mangled-name='GraalPyPrivate_Get_PySliceObject_step' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PySliceObject_step'/>
    <var-decl name='GraalPyPrivate_Get_PySliceObject_stop' type-id='type-id-350' mangled-name='GraalPyPrivate_Get_PySliceObject_stop' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Get_PySliceObject_stop'/>
    <var-decl name='GraalPyPrivate_Iter_Send' type-id='type-id-702' mangled-name='GraalPyPrivate_Iter_Send' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Iter_Send'/>
    <var-decl name='GraalPyPrivate_Long_FromLongLong' type-id='type-id-407' mangled-name='GraalPyPrivate_Long_FromLongLong' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Long_FromLongLong'/>
    <var-decl name='GraalPyPrivate_Long_FromString' type-id='type-id-361' mangled-name='GraalPyPrivate_Long_FromString' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Long_FromString'/>
    <var-decl name='GraalPyPrivate_MemoryViewFromBuffer' type-id='type-id-413' mangled-name='GraalPyPrivate_MemoryViewFromBuffer' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_MemoryViewFromBuffer'/>
    <var-decl name='GraalPyPrivate_NewTypeDict' type-id='type-id-354' mangled-name='GraalPyPrivate_NewTypeDict' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_NewTypeDict'/>
    <var-decl name='GraalPyPrivate_NoValue' type-id='type-id-201' mangled-name='GraalPyPrivate_NoValue' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_NoValue'/>
    <var-decl name='GraalPyPrivate_None' type-id='type-id-201' mangled-name='GraalPyPrivate_None' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_None'/>
    <var-decl name='GraalPyPrivate_NotImplemented' type-id='type-id-201' mangled-name='GraalPyPrivate_NotImplemented' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_NotImplemented'/>
    <var-decl name='GraalPyPrivate_Object_Call1' type-id='type-id-329' mangled-name='GraalPyPrivate_Object_Call1' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_Call1'/>
    <var-decl name='GraalPyPrivate_Object_CallFunctionObjArgs' type-id='type-id-348' mangled-name='GraalPyPrivate_Object_CallFunctionObjArgs' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_CallFunctionObjArgs'/>
    <var-decl name='GraalPyPrivate_Object_CallMethod1' type-id='type-id-339' mangled-name='GraalPyPrivate_Object_CallMethod1' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_CallMethod1'/>
    <var-decl name='GraalPyPrivate_Object_CallMethodObjArgs' type-id='type-id-334' mangled-name='GraalPyPrivate_Object_CallMethodObjArgs' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_CallMethodObjArgs'/>
    <var-decl name='GraalPyPrivate_Object_GenericGetAttr' type-id='type-id-702' mangled-name='GraalPyPrivate_Object_GenericGetAttr' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_GenericGetAttr'/>
    <var-decl name='GraalPyPrivate_Object_GenericGetDict' type-id='type-id-705' mangled-name='GraalPyPrivate_Object_GenericGetDict' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_GenericGetDict'/>
    <var-decl name='GraalPyPrivate_Object_GetItemString' type-id='type-id-338' mangled-name='GraalPyPrivate_Object_GetItemString' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Object_GetItemString'/>
    <var-decl name='GraalPyPrivate_PickleBuffer_viewobj' type-id='type-id-705' mangled-name='GraalPyPrivate_PickleBuffer_viewobj' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PickleBuffer_viewobj'/>
    <var-decl name='GraalPyPrivate_PyNumber_Add' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Add' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Add'/>
    <var-decl name='GraalPyPrivate_PyNumber_And' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_And' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_And'/>
    <var-decl name='GraalPyPrivate_PyNumber_Divmod' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Divmod' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Divmod'/>
    <var-decl name='GraalPyPrivate_PyNumber_FloorDivide' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_FloorDivide' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_FloorDivide'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceAdd' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceAdd' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceAdd'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceAnd' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceAnd' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceAnd'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceFloorDivide' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceFloorDivide' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceFloorDivide'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceLshift' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceLshift' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceLshift'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceMatrixMultiply' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceMatrixMultiply' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceMatrixMultiply'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceMultiply' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceMultiply' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceMultiply'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceOr' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceOr' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceOr'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlacePower' type-id='type-id-703' mangled-name='GraalPyPrivate_PyNumber_InPlacePower' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlacePower'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceRemainder' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceRemainder' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceRemainder'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceRshift' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceRshift' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceRshift'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceSubtract' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceSubtract' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceSubtract'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceTrueDivide' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceTrueDivide' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceTrueDivide'/>
    <var-decl name='GraalPyPrivate_PyNumber_InPlaceXor' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_InPlaceXor' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_InPlaceXor'/>
    <var-decl name='GraalPyPrivate_PyNumber_Lshift' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Lshift' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Lshift'/>
    <var-decl name='GraalPyPrivate_PyNumber_MatrixMultiply' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_MatrixMultiply' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_MatrixMultiply'/>
    <var-decl name='GraalPyPrivate_PyNumber_Multiply' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Multiply' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Multiply'/>
    <var-decl name='GraalPyPrivate_PyNumber_Or' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Or' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Or'/>
    <var-decl name='GraalPyPrivate_PyNumber_Power' type-id='type-id-703' mangled-name='GraalPyPrivate_PyNumber_Power' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Power'/>
    <var-decl name='GraalPyPrivate_PyNumber_Remainder' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Remainder' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Remainder'/>
    <var-decl name='GraalPyPrivate_PyNumber_Rshift' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Rshift' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Rshift'/>
    <var-decl name='GraalPyPrivate_PyNumber_Subtract' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Subtract' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Subtract'/>
    <var-decl name='GraalPyPrivate_PyNumber_TrueDivide' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_TrueDivide' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_TrueDivide'/>
    <var-decl name='GraalPyPrivate_PyNumber_Xor' type-id='type-id-702' mangled-name='GraalPyPrivate_PyNumber_Xor' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_PyNumber_Xor'/>
    <var-decl name='GraalPyPrivate_Sequence_GetItem' type-id='type-id-706' mangled-name='GraalPyPrivate_Sequence_GetItem' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Sequence_GetItem'/>
    <var-decl name='GraalPyPrivate_Set_NextEntry' type-id='type-id-706' mangled-name='GraalPyPrivate_Set_NextEntry' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Set_NextEntry'/>
    <var-decl name='GraalPyPrivate_State_FindModule' type-id='type-id-359' mangled-name='GraalPyPrivate_State_FindModule' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_State_FindModule'/>
    <var-decl name='GraalPyPrivate_True' type-id='type-id-201' mangled-name='GraalPyPrivate_True' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_True'/>
    <var-decl name='GraalPyPrivate_Tuple_GetItem' type-id='type-id-706' mangled-name='GraalPyPrivate_Tuple_GetItem' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Tuple_GetItem'/>
    <var-decl name='GraalPyPrivate_Unicode_AsWideChar' type-id='type-id-343' mangled-name='GraalPyPrivate_Unicode_AsWideChar' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_AsWideChar'/>
    <var-decl name='GraalPyPrivate_Unicode_Decode' type-id='type-id-341' mangled-name='GraalPyPrivate_Unicode_Decode' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_Decode'/>
    <var-decl name='GraalPyPrivate_Unicode_DecodeUTF16Stateful' type-id='type-id-419' mangled-name='GraalPyPrivate_Unicode_DecodeUTF16Stateful' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_DecodeUTF16Stateful'/>
    <var-decl name='GraalPyPrivate_Unicode_DecodeUTF32Stateful' type-id='type-id-419' mangled-name='GraalPyPrivate_Unicode_DecodeUTF32Stateful' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_DecodeUTF32Stateful'/>
    <var-decl name='GraalPyPrivate_Unicode_DecodeUTF8Stateful' type-id='type-id-417' mangled-name='GraalPyPrivate_Unicode_DecodeUTF8Stateful' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_DecodeUTF8Stateful'/>
    <var-decl name='GraalPyPrivate_Unicode_FSDecoder' type-id='type-id-705' mangled-name='GraalPyPrivate_Unicode_FSDecoder' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_FSDecoder'/>
    <var-decl name='GraalPyPrivate_Unicode_FromFormat' type-id='type-id-382' mangled-name='GraalPyPrivate_Unicode_FromFormat' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_FromFormat'/>
    <var-decl name='GraalPyPrivate_Unicode_FromUCS' type-id='type-id-421' mangled-name='GraalPyPrivate_Unicode_FromUCS' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_FromUCS'/>
    <var-decl name='GraalPyPrivate_Unicode_FromUTF' type-id='type-id-421' mangled-name='GraalPyPrivate_Unicode_FromUTF' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_FromUTF'/>
    <var-decl name='GraalPyPrivate_Unicode_LookupAndIntern' type-id='type-id-705' mangled-name='GraalPyPrivate_Unicode_LookupAndIntern' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_LookupAndIntern'/>
    <var-decl name='GraalPyPrivate_Unicode_New' type-id='type-id-415' mangled-name='GraalPyPrivate_Unicode_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Unicode_New'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPyCode_GetFileName' type-id='type-id-309' mangled-name='GraalPyPrivate_Upcall_GraalPyCode_GetFileName' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPyCode_GetFileName'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPyCode_GetName' type-id='type-id-309' mangled-name='GraalPyPrivate_Upcall_GraalPyCode_GetName' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPyCode_GetName'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPyDateTime_DATE_GET_TZINFO' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_GraalPyDateTime_DATE_GET_TZINFO' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPyDateTime_DATE_GET_TZINFO'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPyDateTime_TIME_GET_TZINFO' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_GraalPyDateTime_TIME_GET_TZINFO' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPyDateTime_TIME_GET_TZINFO'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPySlice_Start' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_GraalPySlice_Start' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPySlice_Start'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPySlice_Step' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_GraalPySlice_Step' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPySlice_Step'/>
    <var-decl name='GraalPyPrivate_Upcall_GraalPySlice_Stop' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_GraalPySlice_Stop' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_GraalPySlice_Stop'/>
    <var-decl name='GraalPyPrivate_Upcall_PyBytes_FromObject' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_PyBytes_FromObject' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyBytes_FromObject'/>
    <var-decl name='GraalPyPrivate_Upcall_PyCallIter_New' type-id='type-id-702' mangled-name='GraalPyPrivate_Upcall_PyCallIter_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyCallIter_New'/>
    <var-decl name='GraalPyPrivate_Upcall_PyCapsule_New' type-id='type-id-423' mangled-name='GraalPyPrivate_Upcall_PyCapsule_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyCapsule_New'/>
    <var-decl name='GraalPyPrivate_Upcall_PyClassMethod_New' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_PyClassMethod_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyClassMethod_New'/>
    <var-decl name='GraalPyPrivate_Upcall_PyCodec_Decoder' type-id='type-id-362' mangled-name='GraalPyPrivate_Upcall_PyCodec_Decoder' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyCodec_Decoder'/>
    <var-decl name='GraalPyPrivate_Upcall_PyCodec_Encoder' type-id='type-id-362' mangled-name='GraalPyPrivate_Upcall_PyCodec_Encoder' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyCodec_Encoder'/>
    <var-decl name='GraalPyPrivate_Upcall_PyComplex_FromDoubles' type-id='type-id-390' mangled-name='GraalPyPrivate_Upcall_PyComplex_FromDoubles' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyComplex_FromDoubles'/>
    <var-decl name='GraalPyPrivate_Upcall_PyContextVar_New' type-id='type-id-363' mangled-name='GraalPyPrivate_Upcall_PyContextVar_New' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyContextVar_New'/>
    <var-decl name='GraalPyPrivate_Upcall_PyContextVar_Set' type-id='type-id-702' mangled-name='GraalPyPrivate_Upcall_PyContextVar_Set' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyContextVar_Set'/>
    <var-decl name='GraalPyPrivate_Upcall_PyContext_Copy' type-id='type-id-705' mangled-name='GraalPyPrivate_Upcall_PyContext_Copy' visibility='default' filepath='./graalpython/graalpython/com.oracle.graal.python.cext/src/capi.c' line='201' column='1' elf-symbol-id='GraalPyPrivate_Upcall_PyContext_Copy'/>
